       01  STUDENTS.    
           05  STUDENT-INFO OCCURS 5 TIMES.
               10 SI-NAME          PIC X(50).
               10 SI-AGE           PIC 9(2).
               10 SI-GENDER        PIC X(15).
               10 SI-RELIGION      PIC X(20).