       01  STUDENT-INFO.
           05 SI-NAME          PIC X(50).
           05 SI-AGE           PIC 9(2).
           05 SI-GENDER        PIC X(15).
           05 SI-RELIGION      PIC X(20).